Revit 2027 API
Transform.CreateReflection Method
 Creates a transform that represents a reflection across the given plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform CreateReflection(
	Plane plane
)
Public Shared Function CreateReflection (
	plane As Plane
) As Transform
public:
static Transform^ CreateReflection(
	Plane^ plane
)
static member CreateReflection :
        plane : Plane -> Transform
Parameters
plane Plane
 The plane.
Return Value
Transform
 The new transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
Example
private Transform Reflect(ReferencePlane refPlane)
{
    Transform mirTrans = Transform.CreateReflection(refPlane.GetPlane());
    return mirTrans;
}
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace